artillery.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 100
      name: Ramp up load
    - duration: 600
      arrivalRate: 200
      name: Sustained load
scenarios:
  - flow:
    - get:
        url: "/api/relatedProducts/all"

# $(npm bin)/artillery run artillery.yaml